# 데이터 전처리 예제 1

* **데이터 설명**
  * 본 데이터는 A대학 도서관에서 제공하는 온라인 DB에 대한 사용자별 이용기록(Transaction)입니다.
  * user_id : 사용자ID
  * region : 지역코드
  * college : 단과대학코드
  * major : 전공코드
  * social_position : 직급코드
  * month : 이용월
  * weekday : 이용요일(1:일요일, 2:월요일, 3:화요일, 4:수요일, 5:목요일, 6:금요일, 7:토요일)
  * hour : 이용시각(24H)
  * DB : 이용 온라인 DB

### 0.0. 필요한 패키지를 로딩하세요

In [1]:
import numpy as np
import pandas as pd
# 넘파이
# 판다스

## 1. 데이터 로딩 및 문제 파악하기

### 1.1. 데이터를 로딩하고 처음 5개의 레코드를 출력하세요.

In [2]:
data_01 = pd.read_csv('DATA_01.csv')
data_01.head(5)

  user_id region college major social_position  month  weekday  hour     DB
0   U0002    R01   C0002   M09            S005    3.0        3    21  DB048
1   U0003    R01   C0003   M01            S001    3.0        2    12  DB048
2   U0003    R01   C0003   M01            S001    3.0        2    13  DB048
3   U0006    R01   C0001   M11            S005    3.0        2    14  DB055
4   U0005    R01   C0001   M08            S005    3.0        2    14  DB044

### 1.2. 변수별 데이터 타입을 알아볼 수는 코드를 제시하고 문제점이 있을 경우 서술하세요.

In [7]:
data_01.isnull().sum()
# major, month 컬럼에 1836, 1543개의 결측치 확인됨

user_id               0
region                0
college               0
major              1836
social_position       0
month              1543
weekday               0
hour                  0
DB                    0
dtype: int64

### 1.3. 수치형 변수의 요약 통계량을 제시하세요.

In [13]:
# describe() 활용
data_01.describe().T

            count       mean       std  min   25%   50%   75%   max
month    116186.0   6.879504  3.450912  1.0   4.0   7.0  10.0  12.0
weekday  117729.0   3.850946  1.871778  1.0   2.0   4.0   5.0   7.0
hour     117729.0  13.759974  6.733376  0.0  10.0  15.0  19.0  30.0

### 1.4. 범주형 변수의 요약 통계량을 제시하세요.

In [14]:
data_01.describe(include="object").T

                  count unique    top    freq
user_id          117729   5473  U0061    2477
region           117729      3    R01  110166
college          117729     72  C0001   52531
major            115893     11    M04   27590
social_position  117729      8   S005   39578
DB               117729     76  DB031   23100

## 2. 데이터의 문제 수정하기

### 2.1. NULL값이 존재하는 변수 중 범주형 변수의 NULL값을 'UNKNOWN'으로 대체하고 처리 결과를 제시하세요.

In [20]:
data_01.describe(include='object').fillna('UNKNOWN').isnull().sum()

user_id            0
region             0
college            0
major              0
social_position    0
DB                 0
dtype: int64

### 2.2. NULL값이 존재하는 변수 중 수치형 변수의 NULL값은 제거하고 처리 뒤 데이터의 행과 열을 제시하세요.

In [26]:
numeric_cols = data_01.select_dtypes(include=['number'])

data_cleaned = data_01.dropna(subset=numeric_cols.columns)

print("처리 후 데이터 크기:", data_cleaned.shape)

처리 후 데이터 크기: (116186, 9)